<?php
// +----------------------------------------------------------------------
// | 
// +----------------------------------------------------------------------
// | @copyright (c) 原点 All rights reserved.
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2022/9/26
// +----------------------------------------------------------------------

namespace app\Annotation;

use Attribute;

/**
 * 取消统一输出注解
 * Class NoGlobalResponse
 * @package app\attribute
 */
#[Attribute(Attribute::TARGET_CLASS | Attribute::TARGET_METHOD)]
class NoGlobalResponse
{
}