<?php

// +----------------------------------------------------------------------
// | 自定义状态码类
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2020/5/3
// +----------------------------------------------------------------------

namespace app\constants;

/**
 * 错误状态码
 *
 * 使用该异常时，会触发error日志记录
 */
class ErrorCode extends BaseCode
{
    /*
    4000-4999	系统错误（如数据库连接失败，创建文件失败等）
    */

    /**
     * 未知错误
     * @Message("未知错误")
     * @HttpCode("500")
     */
    const FAIL = 4000;

    // DB错误
    /**
     * 数据库异常
     * @Message("Db error")
     * @HttpCode("500")
     */
    const MYSQL_ERROR = 4001;

    /**
     * 数据库事务回滚
     * @Message("Db rollback")
     * @HttpCode("500")
     */
    const MYSQL_ROLLBACK = 4002;

    /**
     * 数据库保存失败
     * @Message("Db save error")
     * @HttpCode("500")
     */
    const MYSQL_SAVE_ERROR = 4003;
}
