<?php
// +----------------------------------------------------------------------
// | 
// +----------------------------------------------------------------------
// | @copyright (c) http://www.auntec.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2023/6/7
// +----------------------------------------------------------------------
namespace app\exception;

use app\constants\ErrorCode;

/**
 * 错误异常
 */
class ErrorException extends ServiceException
{
    protected string $codeClass = ErrorCode::class;

}