<?php
// +----------------------------------------------------------------------
// | 业务异常类
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2021/3/24
// +----------------------------------------------------------------------

namespace app\exception;

/**
 * 业务异常
 * Class BusinessException
 * @package app\exception
 */
abstract class ServiceException extends \RuntimeException
{
    public int $httpCode = 500;

}